name: "LaneNet"

# Training input.
layers {
  name: "data"
  type: VIDEO_DATA
  top: "data"
  video_data_param {
    source: "/scail/group/deeplearning/driving_data/twangcat/schedules/q50_multilane_planar_train_schedule1_batch48_2cam.txt"
    batch_size: 48
    #rand_skip: 6344
  }
  transform_param {
    mean_file: "driving_img_mean.binaryproto"
  }
  include: { phase: TRAIN }
}

#  lane pixel label and regression label.
layers {
  name: "label"
  type: MULTILANE_LABEL
  top: "label"
  multilane_label_param {
    source: "/scail/group/deeplearning/driving_data/twangcat/schedules/q50_multilane_planar_train_schedule1_batch48_2cam.txt"
    batch_size: 48
    #rand_skip: 6344
  }
  include: { phase: TRAIN }
}

# Test input.
layers {
  name: "data"
  type: VIDEO_DATA
  top: "data"
  video_data_param {
    source: "/scail/group/deeplearning/driving_data/twangcat/schedules/q50_multilane_planar_test_schedule_4-3-14-gilroy-from_gilroy_g1.avi_batch48.txt"
    batch_size: 48
  }
  transform_param {
    mean_file: "driving_img_mean.binaryproto"
  }
  include: { phase: TEST }
}

#  lane pixel label and regression label.
layers {
  name: "label"
  type: MULTILANE_LABEL
  top: "label"
  multilane_label_param {
    source: "/scail/group/deeplearning/driving_data/twangcat/schedules/q50_multilane_planar_test_schedule_4-3-14-gilroy-from_gilroy_g1.avi_batch48.txt"
    batch_size: 48
  }
  include: { phase: TEST }
}


# Splite label layer into pixel and bounding box label.
layers {
  name: "slice-label"
  type: SLICE
  bottom: "label"
  top: "pixel-label"
  top: "bb-label"
  slice_param {
    slice_dim: 1
    slice_point: 16
  }
}

# Concatenate the pixel labels 4/6 folds such that it can be used to mask
# all 4/6 dimensions of the bounding box predictions.
layers {
  name: "pixel-block"
  type: CONCAT
  bottom: "pixel-label"
  bottom: "pixel-label"
  bottom: "pixel-label"
  bottom: "pixel-label"
  bottom: "pixel-label"
  bottom: "pixel-label"
  top: "pixel-block"
  concat_param {
    concat_dim: 1
  }
}

layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "norm1"
  type: LRN
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "norm1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "norm2"
  type: LRN
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "norm2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}
layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "conv3"
  top: "conv4"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu4"
  type: RELU
  bottom: "conv4"
  top: "conv4"
}
layers {
  name: "conv5"
  type: CONVOLUTION
  bottom: "conv4"
  top: "conv5"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu5"
  type: RELU
  bottom: "conv5"
  top: "conv5"
}
layers {
  name: "pool5"
  type: POOLING
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "fc6-conv"
  type: CONVOLUTION
  bottom: "pool5"
  top: "fc6-conv"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 4096
    kernel_size: 6
    pad: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layers {
  name: "relu6"
  type: RELU
  bottom: "fc6-conv"
  top: "fc6-conv"
}
layers {
  name: "drop6"
  type: DROPOUT
  bottom: "fc6-conv"
  top: "fc6-conv"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "fc7-conv"
  type: CONVOLUTION
  bottom: "fc6-conv"
  top: "fc7-conv"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 4096
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layers {
  name: "relu7"
  type: RELU
  bottom: "fc7-conv"
  top: "fc7-conv"
}
layers {
  name: "drop7"
  type: DROPOUT
  bottom: "fc7-conv"
  top: "fc7-conv"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layers {
  name: "bb-output"
  type: CONVOLUTION
  bottom: "fc7-conv"
  top: "bb-output"
  blobs_lr: 100
  blobs_lr: 200
  weight_decay: 0.00001
  weight_decay: 0
  convolution_param {
    num_output: 96 #64
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}

layers {
  name: "pixel-conv"
  type: CONVOLUTION
  bottom: "fc7-conv"
  top: "pixel-conv"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1.0
    }
  }
}

# Pixel level logistic prediction.
#layers {
#  name: "pixel-prob"
#  type: SIGMOID
#  bottom: "pixel-conv"
#  top: "pixel-prob"
#}

# Pixel level logistic loss.
layers {
  name: "pixel-loss"
  type: SIGMOID_CROSS_ENTROPY_LOSS
  bottom: "pixel-conv"
  bottom: "pixel-label"
  top: "pixel-loss"
}

# Masking the regression labels with input label.
layers {
  name: "bb-label-mask"
  type: ELTWISE
  bottom: "pixel-block"
  bottom: "bb-label"
  top: "bb-masked-label"
  eltwise_param {
    operation: PROD
  }
}
# Masking the regression predicts with input label.
layers {
  name: "bb-prob-mask"
  type: ELTWISE
  bottom: "pixel-block"
  bottom: "bb-output"
  top: "bb-masked-output"
  eltwise_param {
    operation: PROD
  }
}

layers {                                                                                                          
  name: "bb-loss"                                                                                                 
  type: L1_LOSS                                                                                                   
  bottom: "bb-masked-output"                                                                                      
  bottom: "bb-masked-label"                                                                                              
  top: "bb-loss"                                                                                                  
  loss_weight: 1                                                                                                  
}  

# Writing the outputs to protobuf files.
layers {                                                                                                          
  name: "blob-writer"                                                                                                 
  type: BLOB_WRITER                                                                                                   
  bottom: "pixel-conv"                                                                                      
  bottom: "bb-masked-output"                                                                                              
  bottom: "pixel-label"                                                                                              
  bottom: "bb-masked-label"                                                                                              
  top: "blob-writer"
  blob_writer_param {
    prefix: "/deep/group/driving_data/twangcat/caffe_results/proto/raw_outputs/4-3-14-gilroy-from_gilroy_g1"
  }
  include: { phase: TEST }                                                                                                  
}  

# Squared loss on the bounding boxes.
#layers {
#  name: "bb-loss"
#  type: EUCLIDEAN_LOSS
#  bottom: "bb-masked-output"
#  bottom: "bb-label"
#  top: "bb-loss"
#  loss_weight: 0.01
#}

# L1 error loss
#layers {
#  name: "bb-diff"
#  type: ELTWISE
#  bottom: "bb-label"
#  bottom: "bb-masked-output"
#  eltwise_param {
#    operation: SUM
#    coeff: 1.0
#    coeff: -1.0
#  }
#  top: "bb-diff"
#}

#layers {
#  name: "bb-loss"
#  type: ABSVAL
#  bottom: "bb-diff"
#  top: "bb-loss"
#  # 1 / (batch_size * 20 * 15 * 64)
#  loss_weight: 0.00001041666666666
#}

#layers {
#  name: "bb-loss-silence"
#  type: SILENCE
#  bottom: "bb-loss"
#}
